<?php

namespace App;

use Illuminate\Database\Eloquent\Model;
use DB;

class Common extends Model
{
    //

    public static function translit(string $string){

	    $converter = array(
	        'а' => 'a',   'б' => 'b',   'в' => 'v',
	        'г' => 'g',   'д' => 'd',   'е' => 'e',
	        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
	        'и' => 'i',   'й' => 'y',   'к' => 'k',
	        'л' => 'l',   'м' => 'm',   'н' => 'n',
	        'о' => 'o',   'п' => 'p',   'р' => 'r',
	        'с' => 's',   'т' => 't',   'у' => 'u',
	        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
	        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
	        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
	        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

	        'А' => 'A',   'Б' => 'B',   'В' => 'V',
	        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
	        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
	        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
	        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
	        'О' => 'O',   'П' => 'P',   'Р' => 'R',
	        'С' => 'S',   'Т' => 'T',   'У' => 'U',
	        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
	        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
	        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
	        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
	        ' ' => '_'
    );
    return strtr($string, $converter);
    }

	public static function translit_reverse(string $string){

	    $converter = array(
	        'a' => 'а',   'b' => 'б',   'v' => 'в',
	        'g' => 'г',   'd' => 'д',   'e' => 'е',
	        'e' => 'ё',   'zh' => 'ж',  'z' => 'з',
	        'i' => 'и',   'y' => 'й',   'k' => 'к',
	        'l' => 'л',   'm' => 'м',   'n' => 'н',
	        'o' => 'о',   'p' => 'п',   'r' => 'р',
	        's' => 'с',   't' => 'т',   'u' => 'у',
	        'f' => 'ф',   'h' => 'х',   'c' => 'ц',
	        'ch' => 'ч',  'sh' => 'ш',  'sch' => 'щ',
	        '\'' => 'ь',  'y' => 'ы',
	        'e' => 'э',   'yu' => 'ю',  'ya' => 'я',
	        'g' => 'ґ',	  'e' => 'є',   'i' => 'і',
	        'yi' => 'ї',

	        'A' => 'А',   'B' => 'Б',   'V' => 'В',
	        'G' => 'Г',   'D' => 'Д',   'E' => 'Е',
	        'E' => 'Ё',   'Zh' => 'Ж',  'Z' => 'З',
	        'I' => 'И',   'Y' => 'Й',   'K' => 'К',
	        'L' => 'Л',   'M' => 'М',   'N' => 'Н',
	        'O' => 'О',   'P' => 'П',   'R' => 'Р',
	        'S' => 'С',   'T' => 'Т',   'U' => 'У',
	        'F' => 'Ф',   'H' => 'Х',   'C' => 'Ц',
	        'CH' => 'Ч',  'SH' => 'Ш',  'SCH' => 'Щ',
	        '\'' => 'Ь',  'Y' => 'Ы',
	        'E' => 'Э',   'U' => 'Ю',  'YA' => 'Я',
	        '_' => ' ',	  'G' => 'Ґ',	  'E' => 'Є',
	        'I' => 'І',   'I' => 'Ї',
    );
    return strtr($string, $converter);
    }

    public static function getPopularity($tag_id){
    	$top_tags_column = DB::table('article_tag')->select('tag_id')->where('tag_id','=',$tag_id)->get();
    	return count($top_tags_column);
    }
}